{
  "_name_or_path": "D:\\models\\gemma-2-9b",
  "add_bias_linear": false,
  "add_qkv_bias": true,
  "apply_query_key_layer_scaling": true,
  "apply_residual_connection_post_layernorm": false,
  "architectures": [
    "GemmaForCausalLM"
  ],
  "attention_dropout": 0.0,
  "attention_softmax_in_fp32": true,
  "auto_map": {
    "AutoConfig": "configuration_gemma.GemmaConfig",
    "AutoModel": "modeling_gemma.GemmaForCausalLM",
    "AutoModelForCausalLM": "modeling_gemma.GemmaForCausalLM",
    "AutoModelForSeq2SeqLM": "modeling_gemma.GemmaForCausalLM",
    "AutoModelForSequenceClassification": "modeling_gemma.GemmaForSequenceClassification"
  },
  "bias_dropout_fusion": true,
  "boi_token_id": 1,
  "classifier_dropout": null,
  "eoi_token_id": 2,
  "eos_token_id": [
    1,
    2
  ],
  "ffn_hidden_size": 12288,
  "fp32_residual_connection": false,
  "hidden_dropout": 0.0,
  "hidden_size": 3584,
  "kv_channels": 128,
  "layernorm_epsilon": 1.0e-6,
  "model_type": "gemma2",
  "multi_query_attention": true,
  "multi_query_group_num": 2,
  "num_attention_heads": 16,
  "num_layers": 42,
  "original_rope": true,
  "pad_token_id": 0,
  "padded_vocab_size": 256000,
  "post_layer_norm": true,
  "pre_seq_len": null,
  "prefix_projection": false,
  "rmsnorm": true,
  "rope_ratio": 1,
  "seq_length": 8192,
  "tie_word_embeddings": false,
  "torch_dtype": "float32",
  "transformers_version": "4.42.3",
  "use_cache": true,
  "vision_config": {
    "dropout_prob": 0.0,
    "hidden_act": "gelu",
    "hidden_size": 2048,
    "image_size": 1120,
    "in_channels": 3,
    "intermediate_size": 15360,
    "layer_norm_eps": 1.0e-6,
    "num_heads": 16,
    "num_hidden_layers": 63,
    "num_positions": 6401,
    "patch_size": 14,
    "scaling_factor": 8
  },
  "vocab_size": 256000
}
